## Adding and removing rows and cols

In [5]:
import pandas as pd

In [6]:
people={
    "first": ["Corey" , "Dobby" , "john"],
    "last" : ["Schafer" , "Jane" , "deo"],
    "email":["core@gmail.com" , "dobby@gmail.com" , "johnDeo@gmail.com"]
}

In [9]:
df = pd.DataFrame(people)

In [10]:
# Here if we want to add first name and last name column
df['first'] + ' ' + df['last']

0    Corey Schafer
1       Dobby Jane
2         john deo
dtype: object

In [11]:
df['full_name'] = df['first'] + ' ' + df['last']

In [12]:
df

   first     last              email      full_name
0  Corey  Schafer     core@gmail.com  Corey Schafer
1  Dobby     Jane    dobby@gmail.com     Dobby Jane
2   john      deo  johnDeo@gmail.com       john deo

In [14]:
# Removing Columns
df.drop(columns=['first','last'] , inplace=True)

In [15]:
df

               email      full_name
0     core@gmail.com  Corey Schafer
1    dobby@gmail.com     Dobby Jane
2  johnDeo@gmail.com       john deo

In [18]:
# If we want it back 
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1       [Dobby, Jane]
2         [john, deo]
Name: full_name, dtype: object

In [19]:
df['full_name'].str.split(' ' , expand=True)

       0        1
0  Corey  Schafer
1  Dobby     Jane
2   john      deo

In [20]:
df[['first','last']] = df['full_name'].str.split(' ' , expand=True)

In [21]:
df

               email      full_name  first     last
0     core@gmail.com  Corey Schafer  Corey  Schafer
1    dobby@gmail.com     Dobby Jane  Dobby     Jane
2  johnDeo@gmail.com       john deo   john      deo

In [23]:
# Adding and removing rows of data
# Adding a single row of data
df.append({'first':'Tony'})

AttributeError: 'DataFrame' object has no attribute 'append'

In [26]:
# df.append({'first':'Tony'} , ignore_index=True)
# It is depricated in pandas so we cannot use it

In [27]:
new_row = {'first': 'Tony'}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

In [28]:
df

               email      full_name  first     last
0     core@gmail.com  Corey Schafer  Corey  Schafer
1    dobby@gmail.com     Dobby Jane  Dobby     Jane
2  johnDeo@gmail.com       john deo   john      deo
3                NaN            NaN   Tony      NaN

In [29]:
people={
    "first": ["Toney" , "Steve"],
    "last" : ["Stark" , "Ragers" ],
    "email":["tony@gmail.com" , "steve@gmail.com" ]
}
df2 = pd.DataFrame(people)

In [30]:
df2

   first    last            email
0  Toney   Stark   tony@gmail.com
1  Steve  Ragers  steve@gmail.com

In [37]:
# Now if we want to merge the two dataframes
df = pd.concat([df, df2], ignore_index=True)

In [38]:
df

               email      full_name  first     last
0     core@gmail.com  Corey Schafer  Corey  Schafer
1    dobby@gmail.com     Dobby Jane  Dobby     Jane
2  johnDeo@gmail.com       john deo   john      deo
3                NaN            NaN   Tony      NaN
4     tony@gmail.com            NaN  Toney    Stark
5    steve@gmail.com            NaN  Steve   Ragers

In [41]:
# Removing Rows 
df.drop(index=3 , inplace=True)

In [42]:
df

               email      full_name  first     last
0     core@gmail.com  Corey Schafer  Corey  Schafer
1    dobby@gmail.com     Dobby Jane  Dobby     Jane
2  johnDeo@gmail.com       john deo   john      deo
4     tony@gmail.com            NaN  Toney    Stark
5    steve@gmail.com            NaN  Steve   Ragers

In [46]:
df.drop(index=df[df['last'] == 'deo'].index)

             email      full_name  first     last
0   core@gmail.com  Corey Schafer  Corey  Schafer
1  dobby@gmail.com     Dobby Jane  Dobby     Jane
4   tony@gmail.com            NaN  Toney    Stark
5  steve@gmail.com            NaN  Steve   Ragers

In [47]:
filt = df['last'] =='deo'
df.drop(index=df[filt].index)

             email      full_name  first     last
0   core@gmail.com  Corey Schafer  Corey  Schafer
1  dobby@gmail.com     Dobby Jane  Dobby     Jane
4   tony@gmail.com            NaN  Toney    Stark
5  steve@gmail.com            NaN  Steve   Ragers